{"format": "layers-model", "generatedBy": "keras v2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.18.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "doodle_classifier", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "bitmap_input"}, "name": "bitmap_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block_1_conv_1", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_conv_1", "inbound_nodes": [[["bitmap_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_1_bn_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_bn_1", "inbound_nodes": [[["block_1_conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_1_relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_1_relu_1", "inbound_nodes": [[["block_1_bn_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_1_conv_2", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_conv_2", "inbound_nodes": [[["block_1_relu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_1_bn_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_bn_2", "inbound_nodes": [[["block_1_conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_1_relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_1_relu_2", "inbound_nodes": [[["block_1_bn_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block_1_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block_1_pool", "inbound_nodes": [[["block_1_relu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_2_conv_1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_conv_1", "inbound_nodes": [[["block_1_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_2_bn_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_bn_1", "inbound_nodes": [[["block_2_conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_2_relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_2_relu_1", "inbound_nodes": [[["block_2_bn_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_2_conv_2", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_conv_2", "inbound_nodes": [[["block_2_relu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_2_bn_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_bn_2", "inbound_nodes": [[["block_2_conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_2_relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_2_relu_2", "inbound_nodes": [[["block_2_bn_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block_2_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block_2_pool", "inbound_nodes": [[["block_2_relu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_3_conv_1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_conv_1", "inbound_nodes": [[["block_2_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_3_bn_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_bn_1", "inbound_nodes": [[["block_3_conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_3_relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_3_relu_1", "inbound_nodes": [[["block_3_bn_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block_3_conv_2", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_conv_2", "inbound_nodes": [[["block_3_relu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block_3_bn_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_bn_2", "inbound_nodes": [[["block_3_conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block_3_relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block_3_relu_2", "inbound_nodes": [[["block_3_bn_2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling", "inbound_nodes": [[["block_3_relu_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding", "inbound_nodes": [[["global_average_pooling", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "classifier_dropout", "trainable": true, "dtype": "float32", "rate": 0.35, "noise_shape": null, "seed": null}, "name": "classifier_dropout", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "class_logits", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "class_logits", "inbound_nodes": [[["classifier_dropout", 0, 0, {}]]]}], "input_layers": [["bitmap_input", 0, 0]], "output_layers": [["class_logits", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "block_1_bn_1/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_1/beta", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_1/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_1/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_2/gamma", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_2/beta", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_2/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "block_1_bn_2/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "block_1_conv_1/kernel", "shape": [3, 3, 1, 48], "dtype": "float32"}, {"name": "block_1_conv_2/kernel", "shape": [3, 3, 48, 48], "dtype": "float32"}, {"name": "block_2_bn_1/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_1/beta", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_1/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_1/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_2/gamma", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_2/beta", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_2/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "block_2_bn_2/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "block_2_conv_1/kernel", "shape": [3, 3, 48, 96], "dtype": "float32"}, {"name": "block_2_conv_2/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "block_3_bn_1/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_1/beta", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_1/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_1/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_2/gamma", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_2/beta", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_2/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "block_3_bn_2/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "block_3_conv_1/kernel", "shape": [3, 3, 96, 192], "dtype": "float32"}, {"name": "block_3_conv_2/kernel", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "class_logits/kernel", "shape": [128, 100], "dtype": "float32"}, {"name": "class_logits/bias", "shape": [100], "dtype": "float32"}, {"name": "embedding/kernel", "shape": [192, 128], "dtype": "float32"}, {"name": "embedding/bias", "shape": [128], "dtype": "float32"}]}]}